tap "aws/tap"
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "shivammathur/php"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# UNIX movie player
brew "mplayer"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Internet file retriever
brew "wget"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
# General-purpose scripting language
brew "shivammathur/php/php"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Allows connection to a computer remotely
cask "anydesk"
# Multi-track audio editor and recorder
cask "audacity"
# Open-source KVM software
cask "barrier"
# Web browser focusing on privacy
cask "brave-browser"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Turns any device with a web browser into a secondary screen
cask "deskreen"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Free and open-source image editor
cask "gimp"
# Client for the Google Drive storage service
cask "google-drive"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Vector graphics editor
cask "inkscape"
# HTTP and GraphQL Client
cask "insomnia"
# Java IDE by JetBrains
cask "intellij-idea"
# Automation software
cask "keyboard-maestro"
# Audio tagger focusing on efficiency
cask "kid3"
# Screen and video recording software
cask "loom"
# Visual diff and merge tool
cask "meld"
# Client-side GUI application for modern database development and operations
cask "nosql-workbench"
# VPN client
cask "private-internet-access"
# Control your tools with a few keystrokes
cask "raycast"
# Screen capture tool with mark up and sharing features
cask "skitch"
# Music streaming service
cask "spotify"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Multimedia player
cask "vlc"
mas "Base64Anywhere", id: 640841706
mas "Bitwarden", id: 1352778147
mas "Color Picker", id: 641027709
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Invisor", id: 442947586
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "UTM", id: 1538878817
