tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Manage multiple Node.js versions
brew "nvm"
# Internet file retriever
brew "wget"
# Allows connection to a computer remotely
cask "anydesk"
# Open-source KVM software
cask "barrier"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Free and open-source image editor
cask "gimp"
# Client for the Google Drive storage service
cask "google-drive"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Vector graphics editor
cask "inkscape"
# HTTP and GraphQL Client
cask "insomnia"
# Java IDE by JetBrains
cask "intellij-idea"
# Automation software
cask "keyboard-maestro"
# Audio tagger focusing on efficiency
cask "kid3"
# Screen and video recording software
cask "loom"
# Control your tools with a few keystrokes
cask "raycast"
# Screen capture tool with mark up and sharing features
cask "skitch"
# Music streaming service
cask "spotify"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Multimedia player
cask "vlc"
mas "Base64Anywhere", id: 640841706
mas "Bitwarden", id: 1352778147
mas "Color Picker", id: 641027709
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
