tap "aljohri/-"
tap "aws/tap"
tap "bbcrd/audiowaveform"
tap "dotenv-linter/tap"
tap "dwarvesf/tap"
tap "eugenmayer/dockersync"
tap "getantibody/tap"
tap "grishka/grishka"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "krtirtho/apps"
tap "roots/tap"
tap "supabase/tap"
tap "tabbyml/tabby"
# Convert APNG animations into animated GIF format
brew "apng2gif"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Switch Apache / Valet / CLI configs between PHP versions
brew "brew-php-switcher"
# Core application library for C
brew "glib"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Core component of the AcoustID project (Audio fingerprinting)
brew "chromaprint"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Diff that understands syntax
brew "difftastic"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Firebase command-line tools
brew "firebase-cli"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git-powered FTP client
brew "git-ftp"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Multimedia framework for research and academic purposes
brew "gpac"
# Library access to GnuPG
brew "gpgme"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake", link: false
# Improved top (interactive process viewer)
brew "htop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# YAML Parser
brew "libyaml"
# Access large language models from the command-line
brew "llm"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Read, create, and modify MP4 files
brew "mp4v2"
# UNIX movie player
brew "mplayer"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql@8.4", restart_service: :changed
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@21"
# Swiss-army knife of markup format conversion
brew "pandoc"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Search PDFs for strings matching a regular expression
brew "pdfgrep"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql@14"
# Parse HTML at the command-line
brew "pup"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display and control your Android device
brew "scrcpy"
# SOund eXchange: universal sound sample translator
brew "sox"
# Tool Command Language
brew "tcl-tk"
# Programmatically correct mistyped console commands
brew "thefuck"
# Upgrade all the things
brew "topgrade"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Supabase CLI
brew "supabase/tap/supabase"
# Tabby: AI Coding Assistant
brew "tabbyml/tabby/tabby"
# Enable Windows-like alt-tab
cask "alt-tab"
# Android SDK component
cask "android-platform-tools"
# Memory training application
cask "anki"
# Allows connection to a computer remotely
cask "anydesk"
# Application uninstaller
cask "appcleaner"
# Manage team projects and tasks
cask "asana"
# Multi-track audio editor and recorder
cask "audacity"
# Design and prototype websites using the Bootstrap framework
cask "bootstrap-studio"
# Web browser focusing on privacy
cask "brave-browser"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Terminal-based AI coding assistant
cask "claude-code"
# Image, video and clipboard optimiser
cask "clop"
# Server and cloud storage browser
cask "cyberduck"
# Tool to compare and synchronise files and folders
cask "deltawalker"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Desktop wallet for cryptocurrency assets
cask "exodus"
# VPN client for secure internet access and private browsing
cask "expressvpn"
# Multi-platform multi-messaging app
cask "ferdium"
# Tool for organising and renaming movies, TV shows, anime or music
cask "filebot"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
cask "font-open-sans"
cask "font-symbols-only-nerd-font"
# GIT client
cask "fork"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Open-source video transcoder
cask "handbrake-app"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Free and open-source media player
cask "iina"
# Vector graphics editor
cask "inkscape"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Automation software
cask "keyboard-maestro"
# Find shortcuts for any installed application
cask "keyclu"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Trims video and audio files losslessly
cask "losslesscut"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# File system integration
cask "macfuse"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Unofficial Google Nearby Share app
cask "neardrop"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# PDF compression tool
cask "pdf-squeezer"
# PDF editing software
cask "pdfpen"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Control your tools with a few keystrokes
cask "raycast"
# MySQL/MariaDB database management
cask "sequel-ace"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Open-source media center
cask "stremio"
# Sync and backup service to Synology NAS drives
cask "synology-drive"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Unpacks archive files
cask "the-unarchiver"
# Utility to change the default backup interval of Time Machine
cask "timemachineeditor"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Multiplayer code editor
cask "zed"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "ColorFolder", id: 1450345160
mas "Exif Editor", id: 1621435983
mas "GarageBand", id: 682658836
mas "Human Japanese Lite", id: 910679636
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "mChapters", id: 563131976
mas "Mosaic", id: 1475100873
mas "Numbers", id: 409203825
mas "Okta Verify", id: 490179405
mas "Pages", id: 409201541
mas "Peek", id: 1554235898
mas "Qi FM", id: 1479696191
mas "QR Capture", id: 1369524274
mas "Texty", id: 1538996043
mas "UTM", id: 1538878817
mas "Xcode", id: 497799835
vscode "ahgood.movetab"
vscode "alefragnani.bookmarks"
vscode "antfu.vite"
vscode "anthropic.claude-code"
vscode "artizon.artizon-vscode-surround"
vscode "astro-build.astro-vscode"
vscode "atdow.vue-jumper"
vscode "betterplace.betterplace-vscode-vitest-runner"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "cfcluan.project-scopes"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "duendelunarllc.vscrof"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fooo.ruby-spec-runner"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gruntfuggly.auto-snippet"
vscode "joao-mbn.react-extract"
vscode "joshmu.periscope"
vscode "kamil-now.kamil-now-black-theme"
vscode "koichisasada.vscode-rdbg"
vscode "lennardv.project-colors"
vscode "letmaik.git-tree-compare"
vscode "lokalise.i18n-ally"
vscode "mehedidracula.php-namespace-resolver"
vscode "misogi.ruby-rubocop"
vscode "modifiedfileidentifier.modifiedfileidentifier"
vscode "mondersky.installation-corrupt-remover"
vscode "mondersky.tabscolor"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.vscode-python-envs"
vscode "mylesmurphy.prettify-ts"
vscode "nicholashsiang.vscode-react-snippet"
vscode "octref.vetur"
vscode "orsenkucher.vscode-graphql"
vscode "outofsync42.select-compare-tabs"
vscode "patbenatar.advanced-new-file"
vscode "percygrunwald.vscode-intellij-recent-files"
vscode "prisma.prisma"
vscode "rvest.vs-code-prettier-eslint"
vscode "sangonz193.vscode-typescript-code-sorter"
vscode "sharashchandradesai.simple-scratch"
vscode "shardulm94.trailing-spaces"
vscode "shazbot.surroundelection"
vscode "shopify.ruby-lsp"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "suhelmakkad.shadcn-ui"
vscode "syler.sass-indented"
vscode "sysoev.vscode-open-in-github"
vscode "tamasfe.even-better-toml"
vscode "toba.vsfire"
vscode "unifiedjs.vscode-mdx"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "webmania.vue-mess-detector"
vscode "xdebug.php-debug"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhihaocui.ts-interface-sorter"
